# Designer's vertues

## 기획자의 덕목

1. 외교관

    1. 특징 - 기획자는 개발자, 디자이너와 고객 사이에 낑겨서 커뮤니케이션을 담당한다.
    개발자, 디자이너 ↔︎ 기획자 ↔︎ 고객
    1. 잡부라는 설이 있지만 그것도 하기 나름인것 같다.
    1. 커뮤니케이션에 관련된 스탯을 올려야 한다.
    1. 박쥐가 되느냐 외교관이 되느냐는 한끗차이인것 같다.
 
2. To Do.

    1. 고객의 요구사항을 맥락을 잘 짚어서 개발자와, 디자이너에게 전달한다.
    2. 개발자와 디자이너가 일할때 필요한 사항들을 잘 정리해서 고객에게 전달한다.

3. Don’t

    1. 고객의 요구를 필터링 없이 개발자, 디자이너에게 전달하기
        고객, 개발자, 디자이너는 각자 자기 영역의 말만 한다. 얼라이언스가 호드의 말을 듣는 것처럼 서로 커뮤니케이션은 안된다. 외교관의 덕목을 살려 서로의 의중을 파악하고 유연하게 전달해야 한다.

    2. 개발자의 의견, 디자이너의 의견을 고객에게 그대로 전달하기
    그대로 전달하는 경우는 .. 기획자가 중간 역할을 못하고 고객의 편에 섰을때도 가능한것같다. 별로 좋은것은 아니지만 기획자도 일단 자기가 살아야 하니까 고객편만 드는데 .. 결국 개발자나 디자이너랑 척을 지더라…
 
    생각보다 양이 많은데?.. 개발자의 덕목과 디자이너의 덕목은 나중에…